In [1]:
#import 2 module (pandas dan numpy)
import pandas as pd
import numpy as np

#mencetak versi pandas dan numpy yang digunakan
print(pd.__version__)
print(np.__version__)

1.2.4
1.20.1

In [2]:
#Data Frame dengan ukuran 5 x 5
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')
#mengisi dataframe dengan angka random 1-10
df = pd.DataFrame(np.random.randint(1,10,size=(n_rows,n_cols)),columns=cols)
df

   A  B  C  D  E
0  3  5  1  5  3
1  5  3  1  5  7
2  1  8  6  7  8
3  3  3  2  1  4
4  7  3  2  1  4

In [3]:
# Untuk membalik urutan kolom digunakan .loc[]
# .loc[] menerima 2 parameter, parameter pertama berfungsi untuk mengatur baris sedangkan parameter kedua berfungsi mengatur kolom

df.loc[:,::-1]

   E  D  C  B  A
0  3  5  1  5  3
1  7  5  1  3  5
2  8  7  6  8  1
3  4  1  2  3  3
4  4  1  2  3  7

In [4]:
#Versi lengkap dari syntax di bawah ini untuk membalik urutan baris adalah df.loc[::-1,:]
df.loc[::-1]

   A  B  C  D  E
4  7  3  2  1  4
3  3  3  2  1  4
2  1  8  6  7  8
1  5  3  1  5  7
0  3  5  1  5  3

In [5]:
# fungsi reset_index digunakan untuk membuat index teratur walaupun isi data frame sudah dibalikkan
df.loc[::-1].reset_index(drop=True)

   A  B  C  D  E
0  7  3  2  1  4
1  3  3  2  1  4
2  1  8  6  7  8
3  5  3  1  5  7
4  3  5  1  5  3

In [6]:
#import 2 module (pandas dan numpy)
import pandas as pd
import numpy as np

#mencetak versi pandas dan numpy yang digunakan
print(pd.__version__)
print(np.__version__)

1.2.4
1.20.1

In [7]:
#Data Frame dengan ukuran 5 x 5
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')
#mengisi dataframe dengan angka random 1-10
df = pd.DataFrame(np.random.randint(1,10,size=(n_rows,n_cols)),columns=cols)
df

   A  B  C  D  E
0  9  4  2  3  7
1  5  1  8  9  1
2  3  1  8  6  7
3  9  1  7  8  7
4  8  1  7  9  2

In [8]:
# Cara mengganti nama (label) pada kolom data frame adalah dengan melewatkan method rename dengan parameter column yang diisi dengan dictionary berisi pasangan key dan value
df.rename(columns={'C':'Hobi'})

   A  B  Hobi  D  E
0  9  4     2  3  7
1  5  1     8  9  1
2  3  1     8  6  7
3  9  1     7  8  7
4  8  1     7  9  2

In [9]:
#Syntax yang digunakan sama akan tetapi parameter diisi dengan pasangan key dan values
df.rename(columns={'A':'Nama','B':'Alamat','D':'Kota'})

   Nama  Alamat  C  Kota  E
0     9       4  2     3  7
1     5       1  8     9  1
2     3       1  8     6  7
3     9       1  7     8  7
4     8       1  7     9  2

In [10]:
#import 2 module (pandas dan numpy)
import pandas as pd
import numpy as np

#mencetak versi pandas dan numpy yang digunakan
print(pd.__version__)
print(np.__version__)

1.2.4
1.20.1

In [11]:
#Membuat data frame yang mengandung missing value dengan fungsi util.testing.makeMissingDataframe()
df = pd.util.testing.makeMissingDataframe().reset_index()
df.head()

C:\Users\steve\anaconda3\lib\site-packages\pandas\util\__init__.py:8: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing

        index         A         B         C         D
0  I5AjoKpsLP       NaN -0.934325 -0.218285  0.361455
1  eV1MHSSHB3 -0.160109 -0.380054 -0.657360 -0.389653
2  ykMnPfhf7Z -0.547415  0.809223  1.021227       NaN
3  BKelmaZ3H3 -1.092408  1.974504 -1.073151 -3.322248
4  a4eZzKVeGh  1.654457 -0.488438  0.054719 -0.286523

In [12]:
# Mengganti label index dengan 'z'
df = df.rename(columns={'index':'Z'})
df.head()

            Z         A         B         C         D
0  I5AjoKpsLP       NaN -0.934325 -0.218285  0.361455
1  eV1MHSSHB3 -0.160109 -0.380054 -0.657360 -0.389653
2  ykMnPfhf7Z -0.547415  0.809223  1.021227       NaN
3  BKelmaZ3H3 -1.092408  1.974504 -1.073151 -3.322248
4  a4eZzKVeGh  1.654457 -0.488438  0.054719 -0.286523

In [13]:
# membuat salinan dari data frame yang mengandung missing value
df_backup = df.copy(deep=True)

In [14]:
# syntax berikut dapat digunakan untuk menghapus missing value yang ditemukan dari setiap kolom pada data frame
df = df.dropna(axis='columns')
df.head()

            Z
0  I5AjoKpsLP
1  eV1MHSSHB3
2  ykMnPfhf7Z
3  BKelmaZ3H3
4  a4eZzKVeGh

In [15]:
df = df_backup.copy(deep=True)
df = df.dropna(axis='rows')
df.head()

             Z         A         B         C         D
1   eV1MHSSHB3 -0.160109 -0.380054 -0.657360 -0.389653
3   BKelmaZ3H3 -1.092408  1.974504 -1.073151 -3.322248
4   a4eZzKVeGh  1.654457 -0.488438  0.054719 -0.286523
5   MxptTMBiWd -0.060336  0.128292 -0.095081  1.185594
10  Ea3atX3NMu  0.613286 -1.242652 -0.252206  0.001181

In [16]:
# df_backup digunakan untuk mengembalikan kondisi data frame ke semula
df = df_backup.copy(deep=True)
# df.isna akan mengumpulkan semua missing value dalam data frame
# .mean() akan mengkalkulasikan rata-rata persentase missing value dari kolom
df.isna().mean()

Z    0.000000
A    0.166667
B    0.066667
C    0.066667
D    0.100000
dtype: float64

In [17]:
#penentuan ambang batas data non missing value 90% (makanya kali 0.9)
treshold = len(df)*0.9
#menghapus kolom berdasarkan acuan treshold
df = df.dropna(thresh = treshold,axis='columns')
df.head()

            Z         B         C         D
0  I5AjoKpsLP -0.934325 -0.218285  0.361455
1  eV1MHSSHB3 -0.380054 -0.657360 -0.389653
2  ykMnPfhf7Z  0.809223  1.021227       NaN
3  BKelmaZ3H3  1.974504 -1.073151 -3.322248
4  a4eZzKVeGh -0.488438  0.054719 -0.286523

In [18]:
#import 2 module (pandas dan numpy)
import pandas as pd
import numpy as np

#mencetak versi pandas dan numpy yang digunakan
print(pd.__version__)
print(np.__version__)

1.2.4
1.20.1

In [19]:
data = {'A':[15,15,18,np.nan,12],
       'B':[15,15,18,np.nan,12]}
df = pd.DataFrame(data)
df

      A     B
0  15.0  15.0
1  15.0  15.0
2  18.0  18.0
3   NaN   NaN
4  12.0  12.0

In [20]:
#sebuah data frame terdiri dari beberapa series
df['A']

0    15.0
1    15.0
2    18.0
3     NaN
4    12.0
Name: A, dtype: float64

In [21]:
type(df['A'])

pandas.core.series.Series

In [22]:
type(df)

pandas.core.frame.DataFrame

In [23]:
# memeriksa kesamaan dengan method == (kurang disarankan)
df['A']==df['B']

0     True
1     True
2     True
3    False
4     True
dtype: bool

In [24]:
# memeriksa kesamaan dengan method equals (lebih disarankan)
df['A'].equals(df['B'])

True

In [25]:
df1 = df.copy(deep=True)
df1.equals(df)

True

In [26]:
df==df1

       A      B
0   True   True
1   True   True
2   True   True
3  False  False
4   True   True